src/cf/Catalogs/уатТарифыЗП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатТарифыЗП</Name>
			<Comment>Тарифы зарплаты сотрудников</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппировкаТарифа1</Name>
					<Comment>Группировка тарифа 1</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатГруппировкиТарифов</v8:Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппировкаТарифа2</Name>
					<Comment>Группировка тарифа 2</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатГруппировкиТарифов</v8:Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппировкаТарифа3</Name>
					<Comment>Группировка тарифа 3</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатГруппировкиТарифов</v8:Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисления</Name>
					<Comment>Вид начисления</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.уатУдержания</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.уатОсновныеНачисления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СложныйТариф</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Comment>Размер тарифа в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетПоСтрокам</Name>
					<Comment>Расчет начислений отдельно по строкам Задания путевого листа, либо по итогам </Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникВыручки</Name>
					<Comment>0 - Заказы на ТС, 1 - Маршрутный лист</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Применение</Name>
					<Comment>0 - Путевые листы, 1 - Маршрутные листы, 2 - Ремонтные листы, 3 - Премия, 4 - Удержание, 5 - Заказы такси</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетОтСуммыБезНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетБезУчетаСкидки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаРасчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗнакГруппировки1</Name>
							<Comment>Знак группировки 1</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.уатЗнакиСравнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗнакГруппировки2</Name>
							<Comment>Знак группировки 2</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.уатЗнакиСравнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗнакГруппировки3</Name>
							<Comment>Знак группировки 3</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.уатЗнакиСравнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеГруппировки1</Name>
							<Comment>Значение группировки 1</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеГруппировки2</Name>
							<Comment>Значение группировки 2</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеГруппировки3</Name>
							<Comment>Значение группировки 3</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Comment>Размер тарифа в валюте управленческого учета</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбластиДействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОбластиДействия</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатВидыОбластейДействияТарифовТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеОбластиДействия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.уатВидыОбластейДействияТарифа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Comment>Организация</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/уатСпособыРасчетаОплатыТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатСпособыРасчетаОплатыТруда</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СдельныйЗаработок</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентомОтВыручки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентомОтВидовНачислений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированнойСуммой</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаЗаНочныеЧасы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаЗаПраздничныеИВыходные</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатВидыОбластейДействияТарифовТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыОбластейДействияТарифовТС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВидГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидПеревозки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидПростоя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидРемонта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидУпаковки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГеозонаНазначения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГеозонаОтправления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГрузовоеМесто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникЗаказа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлассВодителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Маршрут</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МодельПрицепа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МодельТягача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаправлениеПеревозки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъектСтроительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прицеп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПунктНазначения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПунктОтправления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Склад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипКонтейнера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипПрицепа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипТягача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тягач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлассПрицепа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлассТягача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатСпособРасчетаПараметровВыработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатСпособРасчетаПараметровВыработки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КоличествоКонтейнеровПоТипуКонтейнера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоОперацийПоТипуТочкиМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоТочекПоТипуПункта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоУпаковокПоВидуУпаковки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРассчитывать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаданию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказамИМаршрутнымЛистам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПараметруВыработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоТТД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоШапке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяАрендыТС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатГруппировкиТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатГруппировкиТарифов</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Расстояние</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлассГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъемГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтоимостьГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоМест</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Грузоподъемность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъемКузова</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выручка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатСпособыВводаЗначенийВыработкивМЛ_уэ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатСпособыВводаЗначенийВыработкивМЛ_уэ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВЦеломПоДокументу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВТабличнойЧасти</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/уатТарифыЗП/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	ОснОрганизацияПользователя = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяОрганизация");
	ВидНачисленияПредыдущееЗначение = Объект.ВидНачисления;
	ВалютаУпр = Константы.ВалютаУправленческогоУчета.Получить();
	
	Если Объект.Ссылка.Пустая() Тогда
		ИзменениеРеквизитов_ПеренесеноИзУстановитьВидимость();
	КонецЕсли;
		
	ЗаполнитьПредставлениеТС();
	ЗаполнитьСписокВыбораВидНачисления();
	СложныйТарифПереключатель = ?(Объект.СложныйТариф, "Сложный тариф", "Простой тариф");
	
	ВариантПоставкиТакси = уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси();
	
	МассивПрименений = Новый Массив(); 
	МассивПрименений.Добавить("Путевые листы"); 
	МассивПрименений.Добавить("Маршрутные листы");
	МассивПрименений.Добавить("Ремонтные листы");
	МассивПрименений.Добавить("Премии");
	МассивПрименений.Добавить("Удержания"); 
	Если ВариантПоставкиТакси Тогда
		МассивПрименений.Добавить("Заказы такси");
	КонецЕсли;
	Элементы.Применение.СписокВыбора.ЗагрузитьЗначения(МассивПрименений);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПрочитатьЗначениеПрименение();
	УстановитьДоступныеГруппировки();
	УстановитьСписокТиповОбласти();
	ОбновитьФлагПострочныйРасчетПоЗаказамНаТС();
	УстановитьВидимость();
		
	Модифицированность = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполнитьПредставлениеТС();
	ВидНачисленияПредыдущееЗначение = Объект.ВидНачисления;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьПредставлениеТС();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Записан параметр выработки" И Параметр = Объект.ПараметрВыработки Тогда
		ОбновитьФлагПострочныйРасчетПоЗаказамНаТС();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидНачисленияПриИзменении(Элемент)
	
	Если Объект.ВидНачисления = Неопределено Тогда
		Объект.ВидНачисления = ?(Объект.Применение = 4,
		ПредопределенноеЗначение("ПланВидовРасчета.уатУдержания.ПустаяСсылка"),
		ПредопределенноеЗначение("ПланВидовРасчета.уатОсновныеНачисления.ПустаяСсылка"));
	КонецЕсли;
	
	СпособРасчетаОплатыТруда = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.ВидНачисления, "СпособРасчетаОплатыТруда");
	
	Если СпособРасчетаОплатыТруда <> ПредопределенноеЗначение("Перечисление.уатСпособыРасчетаОплатыТруда.СдельныйЗаработок")
		И СпособРасчетаОплатыТруда <> ПредопределенноеЗначение("Перечисление.уатСпособыРасчетаОплатыТруда.ФиксированнойСуммой") Тогда
		
		Если Объект.РасчетПоСтрокам Тогда
			Объект.РасчетПоСтрокам = Ложь;
		КонецЕсли;
		Если Объект.СложныйТариф Тогда
			Объект.СложныйТариф = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ВидНачисления = ПредопределенноеЗначение("ПланВидовРасчета.уатОсновныеНачисления.ОплатаЗаРемонт") Тогда
		Объект.Применение = 2;
		Объект.ПараметрВыработки = ПредопределенноеЗначение("Справочник.уатПараметрыВыработки.ВремяВРемонте");
		ОбновитьФлагПострочныйРасчетПоЗаказамНаТС();
	Иначе
		Если Объект.Применение = 2 Тогда
			Объект.Применение = 0;
		КонецЕсли;
	КонецЕсли;
	
	Если ВидНачисленияПредыдущееЗначение <> Объект.ВидНачисления Тогда
		ОчиститьСложныеТарифы();
	КонецЕсли;
	
	ВидНачисленияПредыдущееЗначение = Объект.ВидНачисления;
	
	ПрочитатьЗначениеПрименение();
	УстановитьДоступныеГруппировки();
	УстановитьСписокТиповОбласти();
	ИзменениеРеквизитов_ПеренесеноИзУстановитьВидимость();
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрВыработкиПриИзменении(Элемент)
	Если (НЕ ПараметрВыработкиПрименимДляПострочногоРасчета()) И Объект.РасчетПоСтрокам Тогда
		Объект.РасчетПоСтрокам = Ложь;
	КонецЕсли;
	
	УстановитьСписокТиповОбласти();
	ОбновитьФлагПострочныйРасчетПоЗаказамНаТС();
	ИзменениеРеквизитов_ПеренесеноИзУстановитьВидимость();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрВыработкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ОтборПараметраВыработки());
		
	ОткрытьФорму("Справочник.уатПараметрыВыработки.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПараметрВыработкиАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПараметрыПолученияДанных.Отбор = ОтборПараметраВыработки();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрВыработкиОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ПараметрыПолученияДанных.Отбор = ОтборПараметраВыработки();
КонецПроцедуры

&НаКлиенте
Функция ОтборПараметраВыработки()
	Рез = Новый Структура;
	Если Объект.Применение = 1 Тогда
		Рез.Вставить("ДействуетНаСотрудниковМЛ", Истина);
	Иначе
		Рез.Вставить("ДействуетНаСотрудников", Истина);
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

&НаКлиенте
Процедура СложныйТарифПриИзменении(Элемент)
	Объект.СложныйТариф = (СложныйТарифПереключатель = "Сложный тариф");
	
	Если Объект.СложныйТариф Тогда
		Объект.Тариф = 0;
	Иначе
		Объект.ГруппировкаТарифа1 = Неопределено;
		Объект.ГруппировкаТарифа2 = Неопределено;
		Объект.ГруппировкаТарифа3 = Неопределено;
		Объект.ТаблицаРасчета.Очистить();
	КонецЕсли;
	
	Модифицированность = Истина;
	ИзменениеРеквизитов_ПеренесеноИзУстановитьВидимость();
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименениеПриИзменении(Элемент)
	
	УстановитьЗначениеПрименение();
	Если Объект.Применение = 1 Тогда
		Объект.РасчетПоСтрокам = Ложь;
	ИначеЕсли Объект.Применение = 3 ИЛИ Объект.Применение = 4 Тогда
		Объект.СложныйТариф = Ложь;
		Объект.РасчетПоСтрокам = Ложь;
		Объект.ПараметрВыработки = Неопределено;
		Объект.ОбластиДействия.Очистить();
		// Если Объект.ВидНачисления, "СпособРасчетаОплатыТруда"
	КонецЕсли;
	
	ЗаполнитьСписокВыбораВидНачисления();
	УстановитьСписокТиповОбласти();
	ИзменениеРеквизитов_ПеренесеноИзУстановитьВидимость();
	УстановитьВидимость();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетПоСтрокамПриИзменении(Элемент)
	УстановитьСписокТиповОбласти();
	ИзменениеРеквизитов_ПеренесеноИзУстановитьВидимость();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаТарифа1ПриИзменении(Элемент)
	ИзменениеРеквизитов_ПеренесеноИзУстановитьВидимость();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаТарифа1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Объект.ВидНачисления <> ПредопределенноеЗначение("ПланВидовРасчета.уатОсновныеНачисления.ОплатаЗаРемонт") Тогда
		ВыборГруппировкиТарифаОткрытьФорму(Элемент);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаТарифа2ПриИзменении(Элемент)
	ИзменениеРеквизитов_ПеренесеноИзУстановитьВидимость();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаТарифа2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Объект.ВидНачисления <> ПредопределенноеЗначение("ПланВидовРасчета.уатОсновныеНачисления.ОплатаЗаРемонт") Тогда
		ВыборГруппировкиТарифаОткрытьФорму(Элемент);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаТарифа3ПриИзменении(Элемент)
	ИзменениеРеквизитов_ПеренесеноИзУстановитьВидимость();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаТарифа3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Объект.ВидНачисления <> ПредопределенноеЗначение("ПланВидовРасчета.уатОсновныеНачисления.ОплатаЗаРемонт") Тогда
		ВыборГруппировкиТарифаОткрытьФорму(Элемент);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыОбластиДействияП

&НаКлиенте
Процедура ОбластиДействияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекСтрока = Элементы.ОбластиДействия.ТекущиеДанные;
	УстановитьТипОбласти(ТекСтрока.ВидОбластиДействия);
КонецПроцедуры

&НаКлиенте
Процедура ОбластиДействияВидОбластиДействияПриИзменении(Элемент)
	ТекСтрока = Элементы.ОбластиДействия.ТекущиеДанные;
	ТекСтрока.ЗначениеОбластиДействия = Неопределено;
	УстановитьТипОбласти(ТекСтрока.ВидОбластиДействия);
	ЗаполнитьПредставлениеТС();
КонецПроцедуры

&НаКлиенте
Процедура ОбластиДействияЗначениеОбластиДействияПриИзменении(Элемент)
	ЗаполнитьПредставлениеТС();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПредставлениеТС()
	Для Каждого ТекСтрока Из Объект.ОбластиДействия Цикл
		Если ТекСтрока.ВидОбластиДействия = Перечисления.уатВидыОбластейДействияТарифовТС.Тягач Тогда
			ПредставлениеТС_ = Строка(ТекСтрока.ЗначениеОбластиДействия);
		Иначе
			ПредставлениеТС_ = "";
		КонецЕсли;
		Если ТекСтрока.ПредставлениеТС <> ПредставлениеТС_ Тогда
			ТекСтрока.ПредставлениеТС = ПредставлениеТС_;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПараметрВыработкиПрименимДляПострочногоРасчета()
	мсвПараметровВыработки = Новый Массив;
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.ВесГруза);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.Объем);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.ВремяВРаботе);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.КоличествоЕздок);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.КоличествоОпераций);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.КоличествоПассажиров);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.ПогрузочноРазгрузочныеРаботы);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.Подача);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.ПробегСГрузом);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.ПробегПорожний);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.ПробегСпециальнойРаботы);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.ПробегСпециальнойРаботы2);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.ПробегСпециальнойРаботы3);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.ПробегСпециальнойРаботы4);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.ПробегСпециальнойРаботы5);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.ПростойПодПогрузкой);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.ПростойПодРазгрузкой);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.ТнКм);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.ОбъемКм);
	
	Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатПараметрыВыработки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.уатПараметрыВыработки КАК уатПараметрыВыработки
		|ГДЕ
		|	НЕ уатПараметрыВыработки.ПометкаУдаления
		|	И НЕ уатПараметрыВыработки.Предопределенный
		|	И уатПараметрыВыработки.СпособРасчетаПараметровВыработки = &СпособРасчетаПараметровВыработки");
		Запрос.УстановитьПараметр("СпособРасчетаПараметровВыработки", Перечисления.уатСпособРасчетаПараметровВыработки.ПоЗаданию);
		мсвДопПараметры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		Для Каждого ТекДопПараметр Из мсвДопПараметры Цикл
			мсвПараметровВыработки.Добавить(ТекДопПараметр);
		КонецЦикла;
	КонецЕсли;
		
	Возврат мсвПараметровВыработки.Найти(Объект.ПараметрВыработки) <> Неопределено;
КонецФункции

&НаКлиенте
Процедура УстановитьВидимость()
	СпособРасчетаОплатыТруда = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.ВидНачисления, "СпособРасчетаОплатыТруда");
	ЭтоСдельныйЗаработок = (СпособРасчетаОплатыТруда = 
		ПредопределенноеЗначение("Перечисление.уатСпособыРасчетаОплатыТруда.СдельныйЗаработок"));
	ЭтоФиксТариф = (СпособРасчетаОплатыТруда = 
		ПредопределенноеЗначение("Перечисление.уатСпособыРасчетаОплатыТруда.ФиксированнойСуммой"));
		
	Если СпособРасчетаОплатыТруда = 
			ПредопределенноеЗначение("Перечисление.уатСпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы")
		ИЛИ СпособРасчетаОплатыТруда = 
			ПредопределенноеЗначение("Перечисление.уатСпособыРасчетаОплатыТруда.ПроцентомОтВидовНачислений")
		ИЛИ СпособРасчетаОплатыТруда = 
			ПредопределенноеЗначение("Перечисление.уатСпособыРасчетаОплатыТруда.ПроцентомОтВыручки")
		ИЛИ СпособРасчетаОплатыТруда = 
			ПредопределенноеЗначение("Перечисление.уатСпособыРасчетаОплатыТруда.ДоплатаЗаПраздничныеИВыходные") Тогда
		Элементы.ДекорацияТариф.Заголовок = "%";
	Иначе
		Элементы.ДекорацияТариф.Заголовок = ВалютаУпр;
	КонецЕсли;
	
	Элементы.ГруппаТариф.Видимость = НЕ Объект.СложныйТариф;
	Элементы.ГруппаТаблицаРасчета.Видимость = Объект.СложныйТариф;
	
	Если Объект.СложныйТариф Тогда
		Элементы.ТаблицаРасчетаЗнакГруппировки1.Видимость	  = ЗначениеЗаполнено(Объект.ГруппировкаТарифа1);
		Элементы.ТаблицаРасчетаЗначениеГруппировки1.Видимость = Элементы.ТаблицаРасчетаЗнакГруппировки1.Видимость;
		Элементы.ТаблицаРасчетаЗначениеГруппировки1.Заголовок = Объект.ГруппировкаТарифа1;
		Элементы.ТаблицаРасчетаЗнакГруппировки2.Видимость	  = ЗначениеЗаполнено(Объект.ГруппировкаТарифа2);
		Элементы.ТаблицаРасчетаЗначениеГруппировки2.Видимость = Элементы.ТаблицаРасчетаЗнакГруппировки2.Видимость;
		Элементы.ТаблицаРасчетаЗначениеГруппировки2.Заголовок = Объект.ГруппировкаТарифа2;		
		Элементы.ТаблицаРасчетаЗнакГруппировки3.Видимость	  = ЗначениеЗаполнено(Объект.ГруппировкаТарифа3);
		Элементы.ТаблицаРасчетаЗначениеГруппировки3.Видимость = Элементы.ТаблицаРасчетаЗнакГруппировки3.Видимость;
		Элементы.ТаблицаРасчетаЗначениеГруппировки3.Заголовок = Объект.ГруппировкаТарифа3;		
		
		Элементы.ТаблицаРасчетаТариф.Видимость = ЗначениеЗаполнено(Объект.ВидНачисления);
		
		Если Элементы.ТаблицаРасчетаЗначениеГруппировки1.Видимость Тогда
			Если Объект.ГруппировкаТарифа1 = ПредопределенноеЗначение("Перечисление.уатГруппировкиТарифов.КлассГруза") Тогда
				Элементы.ТаблицаРасчетаЗначениеГруппировки1.Формат = "ЧДЦ = 1; ЧЦ = 2";
				Элементы.ТаблицаРасчетаЗначениеГруппировки1.ФорматРедактирования = "ЧДЦ = 1; ЧЦ = 2";
				Элементы.ТаблицаРасчетаЗначениеГруппировки1.МинимальноеЗначение = 0;
			Иначе
				Элементы.ТаблицаРасчетаЗначениеГруппировки1.Формат = "ЧДЦ = 3; ЧЦ = 10";
				Элементы.ТаблицаРасчетаЗначениеГруппировки1.ФорматРедактирования = "ЧДЦ = 3; ЧЦ = 10";
				Элементы.ТаблицаРасчетаЗначениеГруппировки1.МинимальноеЗначение = Неопределено;
			КонецЕсли;
		КонецЕсли;
		Если Элементы.ТаблицаРасчетаЗначениеГруппировки2.Видимость Тогда
			Если Объект.ГруппировкаТарифа2 = ПредопределенноеЗначение("Перечисление.уатГруппировкиТарифов.КлассГруза") Тогда
				Элементы.ТаблицаРасчетаЗначениеГруппировки2.Формат = "ЧДЦ = 1; ЧЦ = 2";
				Элементы.ТаблицаРасчетаЗначениеГруппировки2.ФорматРедактирования = "ЧДЦ = 1; ЧЦ = 2";
				Элементы.ТаблицаРасчетаЗначениеГруппировки2.МинимальноеЗначение = 0;
			Иначе
				Элементы.ТаблицаРасчетаЗначениеГруппировки2.Формат = "ЧДЦ = 3; ЧЦ = 10";
				Элементы.ТаблицаРасчетаЗначениеГруппировки2.ФорматРедактирования = "ЧДЦ = 3; ЧЦ = 10";
				Элементы.ТаблицаРасчетаЗначениеГруппировки2.МинимальноеЗначение = Неопределено;
			КонецЕсли;
		КонецЕсли;
		Если Элементы.ТаблицаРасчетаЗначениеГруппировки3.Видимость Тогда
			Если Объект.ГруппировкаТарифа3 = ПредопределенноеЗначение("Перечисление.уатГруппировкиТарифов.КлассГруза") Тогда
				Элементы.ТаблицаРасчетаЗначениеГруппировки3.Формат = "ЧДЦ = 1; ЧЦ = 2";
				Элементы.ТаблицаРасчетаЗначениеГруппировки3.ФорматРедактирования = "ЧДЦ = 1; ЧЦ = 2";
				Элементы.ТаблицаРасчетаЗначениеГруппировки3.МинимальноеЗначение = 0;
			Иначе
				Элементы.ТаблицаРасчетаЗначениеГруппировки3.Формат = "ЧДЦ = 3; ЧЦ = 10";
				Элементы.ТаблицаРасчетаЗначениеГруппировки3.ФорматРедактирования = "ЧДЦ = 3; ЧЦ = 10";
				Элементы.ТаблицаРасчетаЗначениеГруппировки3.МинимальноеЗначение = Неопределено;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.СложныйТариф.Видимость		             = ЭтоСдельныйЗаработок ИЛИ ЭтоФиксТариф И Объект.Применение <> 3
		И Объект.Применение <> 4;
	Элементы.ПараметрВыработки.Видимость             = ЭтоСдельныйЗаработок;
	Элементы.РасчетПоСтрокам.Видимость	             = Объект.Применение <> 1 И Объект.Применение <> 3 И Объект.Применение <> 5
		И Объект.Применение <> 4 И (ЭтоСдельныйЗаработок
		И ПараметрВыработкиПрименимДляПострочногоРасчета() ИЛИ ЭтоФиксТариф);
	Элементы.ПострочныйРасчетПоЗаказамНаТС.Видимость = Объект.Применение = 1 И ЭтоСдельныйЗаработок;
	Элементы.ГруппаПодсказка.Видимость               = Объект.РасчетПоСтрокам
		ИЛИ уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.ПараметрВыработки, "СпособВводаЗначений")
		= ПредопределенноеЗначение("Перечисление.уатСпособыВводаЗначенийВыработкивМЛ_уэ.ВТабличнойЧасти");
		
	Элементы.ГруппаОбластиДействия.Видимость = Объект.Применение <> 3 И Объект.Применение <> 4;
	Если Объект.Применение = 3 ИЛИ Объект.Применение = 4 Тогда
		Элементы.ВидНачисления.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	Иначе
		Элементы.ВидНачисления.ОтображениеПодсказки = ОтображениеПодсказки.Авто;
	КонецЕсли;
	
	ЭтоОплатаЗаРемонт = (Объект.ВидНачисления = 
		ПредопределенноеЗначение("ПланВидовРасчета.уатОсновныеНачисления.ОплатаЗаРемонт"));
	Элементы.ПараметрВыработки.ТолькоПросмотр = ЭтоОплатаЗаРемонт;
	
	Элементы.тПодсказкаРасчетПраздники.Видимость =
		(Объект.ПараметрВыработки = ПредопределенноеЗначение("Справочник.уатПараметрыВыработки.ВремяРаботыВВыходныеДни")
		ИЛИ Объект.ПараметрВыработки = ПредопределенноеЗначение("Справочник.уатПараметрыВыработки.ВремяПраздничное"));
	Элементы.тПодсказкаРасчетДоплаты.Видимость = (Объект.ВидНачисления = 
		ПредопределенноеЗначение("ПланВидовРасчета.уатОсновныеНачисления.ДоплатаЗаПраздничныеИВыходные"));
	Элементы.ГруппаПодсказкаРасчет.Видимость = (Элементы.тПодсказкаРасчетПраздники.Видимость
		ИЛИ Элементы.тПодсказкаРасчетДоплаты.Видимость);
		
	Элементы.ИсточникВыручкиМЛ.Видимость = (Объект.Применение = 1) И (СпособРасчетаОплатыТруда = 
		ПредопределенноеЗначение("Перечисление.уатСпособыРасчетаОплатыТруда.ПроцентомОтВыручки"))
		ИЛИ Объект.СложныйТариф
		И (Объект.ГруппировкаТарифа1 = ПредопределенноеЗначение("Перечисление.уатГруппировкиТарифов.Выручка")
		ИЛИ Объект.ГруппировкаТарифа2 = ПредопределенноеЗначение("Перечисление.уатГруппировкиТарифов.Выручка")
		ИЛИ Объект.ГруппировкаТарифа3 = ПредопределенноеЗначение("Перечисление.уатГруппировкиТарифов.Выручка"));
	Элементы.РасчетОтСуммыБезНДС.Видимость = (Объект.Применение = 5) И (СпособРасчетаОплатыТруда = 
		ПредопределенноеЗначение("Перечисление.уатСпособыРасчетаОплатыТруда.ПроцентомОтВыручки"));
	Элементы.РасчетБезУчетаСкидки.Видимость = (Объект.Применение = 5) И (СпособРасчетаОплатыТруда = 
		ПредопределенноеЗначение("Перечисление.уатСпособыРасчетаОплатыТруда.ПроцентомОтВыручки"));	
	ОбновитьФлагПострочныйРасчетПоЗаказамНаТС();
КонецПроцедуры

&НаСервере
Процедура ИзменениеРеквизитов_ПеренесеноИзУстановитьВидимость()
	
	Если НЕ Объект.СложныйТариф Тогда
		Если Объект.ТаблицаРасчета.Количество() > 0 Тогда
			Объект.ТаблицаРасчета.Очистить();
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ГруппировкаТарифа1) Тогда
			Объект.ГруппировкаТарифа1 = Неопределено;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ГруппировкаТарифа2) Тогда
			Объект.ГруппировкаТарифа2 = Неопределено;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ГруппировкаТарифа3) Тогда
			Объект.ГруппировкаТарифа3 = Неопределено;
		КонецЕсли;
	Иначе
		Если Объект.Тариф <> 0 Тогда
			Объект.Тариф = 0;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ВидНачисления.СпособРасчетаОплатыТруда <> Перечисления.уатСпособыРасчетаОплатыТруда.СдельныйЗаработок Тогда
		Если Объект.ВидНачисления.СпособРасчетаОплатыТруда <> Перечисления.уатСпособыРасчетаОплатыТруда.ФиксированнойСуммой Тогда
			Объект.СложныйТариф = Ложь;
		КонецЕсли;
		
		Объект.ПараметрВыработки = ПредопределенноеЗначение("Справочник.уатПараметрыВыработки.ПустаяСсылка");
	КонецЕсли;
	
	Если НЕ Элементы.РасчетПоСтрокам.Видимость Тогда
		Объект.РасчетПоСтрокам = Ложь;
	КонецЕсли;
    	
КонецПроцедуры
	
&НаКлиенте
Процедура УстановитьТипОбласти(ТипОбласти)
	флПрофКорп           = НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД();
	ВариантПоставкиТакси = уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси();
	Если НЕ ЗначениеЗаполнено(ТипОбласти) Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("Неопределено");
	ИначеЕсли ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.Тягач") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.уатТС");
	ИначеЕсли ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.МодельТягача") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.уатМоделиТС");
	ИначеЕсли ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.ТипТягача") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.уатТипыТС");
	ИначеЕсли ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.КлассТягача") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.уатКлассыТС");
	ИначеЕсли ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.Контрагент") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	ИначеЕсли ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.Подразделение") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций");
	ИначеЕсли ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.Маршрут") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.уатМаршруты");
	ИначеЕсли ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.ПунктОтправления")
		ИЛИ ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.ПунктНазначения") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.уатПунктыНазначения");
	ИначеЕсли ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.Номенклатура") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ИначеЕсли ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.ВидРемонта") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.уатВидыОбслуживанияТС");
	ИначеЕсли ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.КлассВодителя") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("Число");
	ИначеЕсли ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.ВидПростоя") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.уатСостояниеТС");
	ИначеЕсли флПрофКорп И ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.ОбъектСтроительства") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.уатОбъектыСтроительства");
	ИначеЕсли флПрофКорп И ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.ВидПеревозки") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.уатВидыПеревозок");
	ИначеЕсли флПрофКорп И ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.НаправлениеПеревозки") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.уатНаправленияПеревозок");
	ИначеЕсли флПрофКорп И (ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.ГеозонаОтправления")
		ИЛИ ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.ГеозонаНазначения")) Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.уатГеозоны_уэ");
	ИначеЕсли флПрофКорп И ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.ГрузовоеМесто") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.уатГрузовыеМеста_уэ");
	ИначеЕсли флПрофКорп И ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.ВидГруза") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.уатВидыГрузов");
	ИначеЕсли ВариантПоставкиТакси И ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.ФормаОплаты") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.такФормыОплаты"); 
	ИначеЕсли ВариантПоставкиТакси И ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.ИсточникЗаказа") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.такИсточникиЗаказов");
	КонецЕсли;
	
	Элементы.ОбластиДействияЗначениеОбластиДействия.ОграничениеТипа = ТекОграничениеТипа;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСписокТиповОбласти()
	Элементы.ОбластиДействияВидОбластиДействия.СписокВыбора.Очистить();
	
	СписокДоступныхВидовОбластиДействия = СписокДоступныхВидовОбластиДействия();
	Для Каждого ТекЭлем Из СписокДоступныхВидовОбластиДействия Цикл
		Элементы.ОбластиДействияВидОбластиДействия.СписокВыбора.Добавить(ТекЭлем.Значение, ТекЭлем.Представление);
	КонецЦикла;
	
	// Удаление строки области действия, если вид области не входит в список доступных видов
	// например, Контрагент не будет доступен, если снят флаг "Построчный расчет"
	СчОбласть = Объект.ОбластиДействия.Количество() - 1;
	Пока СчОбласть >= 0 Цикл
		ТекОбласть = Объект.ОбластиДействия[СчОбласть];
		Если СписокДоступныхВидовОбластиДействия.НайтиПоЗначению(ТекОбласть.ВидОбластиДействия) = Неопределено Тогда
			Объект.ОбластиДействия.Удалить(СчОбласть);
		КонецЕсли;
		СчОбласть = СчОбласть - 1;
	КонецЦикла;
	
	Если Объект.Применение = 4 Тогда
		Элементы.ОбластиДействияВидОбластиДействия.ОграничениеТипа = Новый ОписаниеТипов("ПланВидовРасчетаСсылка.уатУдержания");
	Иначе
		Элементы.ОбластиДействияВидОбластиДействия.ОграничениеТипа = Новый ОписаниеТипов("ПланВидовРасчетаСсылка.уатОсновныеНачисления");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СписокДоступныхВидовОбластиДействия()
	Возврат Справочники.уатТарифыЗП.СписокДоступныхВидовОбластиДействия(Объект.ВидНачисления, Объект.РасчетПоСтрокам,
		Объект.Применение, Объект.ПараметрВыработки);
КонецФункции

&НаКлиенте
Процедура УстановитьДоступныеГруппировки()
	
	флОплатаЗаРемонт = (Объект.ВидНачисления = ПредопределенноеЗначение("ПланВидовРасчета.уатОсновныеНачисления.ОплатаЗаРемонт"));
	
	Элементы.ГруппировкаТарифа1.СписокВыбора.Очистить();
	Элементы.ГруппировкаТарифа2.СписокВыбора.Очистить();
	Элементы.ГруппировкаТарифа3.СписокВыбора.Очистить();
	Элементы.ГруппировкаТарифа1.КнопкаВыпадающегоСписка = флОплатаЗаРемонт;
	Элементы.ГруппировкаТарифа2.КнопкаВыпадающегоСписка = флОплатаЗаРемонт;
	Элементы.ГруппировкаТарифа3.КнопкаВыпадающегоСписка = флОплатаЗаРемонт;
	
	Если флОплатаЗаРемонт Тогда
		списГруппировки = Новый СписокЗначений;
		списГруппировки.Добавить(ПредопределенноеЗначение("Перечисление.уатГруппировкиТарифов.ВремяРаботы"), "Время в ремонте");
		списГруппировки.Добавить(ПредопределенноеЗначение("Перечисление.уатГруппировкиТарифов.Грузоподъемность"));
		списГруппировки.Добавить(ПредопределенноеЗначение("Перечисление.уатГруппировкиТарифов.ОбъемКузова"));
		Элементы.ГруппировкаТарифа1.РежимВыбораИзСписка = Истина;
		Элементы.ГруппировкаТарифа2.РежимВыбораИзСписка = Истина;
		Элементы.ГруппировкаТарифа3.РежимВыбораИзСписка = Истина;
		Для Каждого ТекГруп Из списГруппировки Цикл
			Элементы.ГруппировкаТарифа1.СписокВыбора.Добавить(ТекГруп.Значение, ТекГруп.Представление);
			Элементы.ГруппировкаТарифа2.СписокВыбора.Добавить(ТекГруп.Значение, ТекГруп.Представление);
			Элементы.ГруппировкаТарифа3.СписокВыбора.Добавить(ТекГруп.Значение, ТекГруп.Представление);
		КонецЦикла;
	Иначе
		Элементы.ГруппировкаТарифа1.РежимВыбораИзСписка = Ложь;
		Элементы.ГруппировкаТарифа2.РежимВыбораИзСписка = Ложь;
		Элементы.ГруппировкаТарифа3.РежимВыбораИзСписка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборГруппировкиТарифаОткрытьФорму(Элемент)
	
	ДополнительныеПараметры = Новый Структура("Элемент", Элемент);
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыборГруппировкиТарифаЗавершение", ЭтаФорма, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;
	списГруппировки = Новый СписокЗначений;
	//Если Объект.ВидНачисления = ПредопределенноеЗначение("ПланВидовРасчета.уатОсновныеНачисления.ОплатаЗаРемонт") Тогда
	//	списГруппировки.Добавить(ПредопределенноеЗначение("Перечисление.уатГруппировкиТарифов.ВремяРаботы"));
	//	списГруппировки.Добавить(ПредопределенноеЗначение("Перечисление.уатГруппировкиТарифов.Грузоподъемность"));
	//	списГруппировки.Добавить(ПредопределенноеЗначение("Перечисление.уатГруппировкиТарифов.ОбъемКузова"));
	//Иначе
		списГруппировки.Добавить(ПредопределенноеЗначение("Перечисление.уатГруппировкиТарифов.Грузоподъемность"));
		списГруппировки.Добавить(ПредопределенноеЗначение("Перечисление.уатГруппировкиТарифов.ОбъемКузова"));
		списГруппировки.Добавить(ПредопределенноеЗначение("Перечисление.уатГруппировкиТарифов.КлассГруза"));
		Если уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.ВидНачисления, "СпособРасчетаОплатыТруда")
			= ПредопределенноеЗначение("Перечисление.уатСпособыРасчетаОплатыТруда.СдельныйЗаработок")
			ИЛИ уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.ВидНачисления, "СпособРасчетаОплатыТруда")
			= ПредопределенноеЗначение("Перечисление.уатСпособыРасчетаОплатыТруда.ФиксированнойСуммой") Тогда
			списГруппировки.Добавить(ПредопределенноеЗначение("Перечисление.уатГруппировкиТарифов.Выручка"));
		КонецЕсли;
	//КонецЕсли;
	ПараметрыФормы.Вставить("ДополнительныеГруппировки", списГруппировки);
	ПараметрыФормы.Вставить("ВидНачисления", Объект.ВидНачисления);
	
	ОткрытьФорму("Справочник.уатТарифыЗП.Форма.ФормаВыбораГруппировкиТарифа", ПараметрыФормы,ЭтаФорма,,,,ОповещениеОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВыборГруппировкиТарифаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Элемент = Элементы.ГруппировкаТарифа1 Тогда
		Объект.ГруппировкаТарифа1 = Результат;
	ИначеЕсли ДополнительныеПараметры.Элемент = Элементы.ГруппировкаТарифа2 Тогда
		Объект.ГруппировкаТарифа2 = Результат;
	ИначеЕсли ДополнительныеПараметры.Элемент = Элементы.ГруппировкаТарифа3 Тогда
		Объект.ГруппировкаТарифа3 = Результат;
	КонецЕсли;
	ИзменениеРеквизитов_ПеренесеноИзУстановитьВидимость();
	
	Модифицированность = Истина;
		
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСложныеТарифы()
	Объект.ГруппировкаТарифа1 = Неопределено;
	Объект.ГруппировкаТарифа2 = Неопределено;
	Объект.ГруппировкаТарифа3 = Неопределено;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораВидНачисления()
	
	Элементы.ВидНачисления.СписокВыбора.Очистить();
	
	Если Объект.Применение = 4 Тогда // Удержание
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	уатУдержания.Ссылка КАК Ссылка,
		|	1 КАК ИндексКартинки
		|ИЗ
		|	ПланВидовРасчета.уатУдержания КАК уатУдержания
		|ГДЕ
		|	НЕ уатУдержания.ПометкаУдаления");
	Иначе //Начисление		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	уатОсновныеНачисления.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА уатОсновныеНачисления.СпособРасчетаОплатыТруда = ЗНАЧЕНИЕ(Перечисление.уатСпособыРасчетаОплатыТруда.СдельныйЗаработок)
		|			ТОГДА 0
		|		КОГДА уатОсновныеНачисления.СпособРасчетаОплатыТруда = ЗНАЧЕНИЕ(Перечисление.уатСпособыРасчетаОплатыТруда.ФиксированнойСуммой)
		|			ТОГДА 1
		|		КОГДА уатОсновныеНачисления.СпособРасчетаОплатыТруда = ЗНАЧЕНИЕ(Перечисление.уатСпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы)
		|				ИЛИ уатОсновныеНачисления.СпособРасчетаОплатыТруда = ЗНАЧЕНИЕ(Перечисление.уатСпособыРасчетаОплатыТруда.ДоплатаЗаПраздничныеИВыходные)
		|			ТОГДА 2
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК ИндексКартинки
		|ИЗ
		|	ПланВидовРасчета.уатОсновныеНачисления КАК уатОсновныеНачисления
		|ГДЕ
		|	НЕ уатОсновныеНачисления.ПометкаУдаления
		|	И (&Применение = 2
		|				И (уатОсновныеНачисления.Ссылка = ЗНАЧЕНИЕ(ПланВидовРасчета.уатОсновныеНачисления.ОплатаЗаРемонт)
		|					ИЛИ уатОсновныеНачисления.СпособРасчетаОплатыТруда = ЗНАЧЕНИЕ(Перечисление.уатСпособыРасчетаОплатыТруда.ПроцентомОтВидовНачислений))
		|			ИЛИ &Применение = 3
		|				И уатОсновныеНачисления.СпособРасчетаОплатыТруда = ЗНАЧЕНИЕ(Перечисление.уатСпособыРасчетаОплатыТруда.ФиксированнойСуммой)
		|			ИЛИ &Применение = 5
		|				И (уатОсновныеНачисления.СпособРасчетаОплатыТруда = ЗНАЧЕНИЕ(Перечисление.уатСпособыРасчетаОплатыТруда.ФиксированнойСуммой)
		|					ИЛИ уатОсновныеНачисления.СпособРасчетаОплатыТруда = ЗНАЧЕНИЕ(Перечисление.уатСпособыРасчетаОплатыТруда.ПроцентомОтВыручки))
		|			ИЛИ &Применение <> 2
		|				И &Применение <> 3
		|				И &Применение <> 5)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИндексКартинки,
		|	уатОсновныеНачисления.Наименование");
	КонецЕсли;
	Запрос.УстановитьПараметр("Применение", Объект.Применение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ИндексКартинки = 0 Тогда
			ТекКартинка = БиблиотекаКартинок.уатТарифПоВыработке;
		ИначеЕсли Выборка.ИндексКартинки = 1 Тогда
			ТекКартинка = БиблиотекаКартинок.уатТарифФиксированный;
		ИначеЕсли Выборка.ИндексКартинки = 2 Тогда
			ТекКартинка = БиблиотекаКартинок.уатТарифДоплата;
		Иначе
			ТекКартинка = БиблиотекаКартинок.уатТарифПроцентом;
		КонецЕсли;
					
		Элементы.ВидНачисления.СписокВыбора.Добавить(Выборка.Ссылка,,, ТекКартинка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФлагПострочныйРасчетПоЗаказамНаТС()
	ПострочныйРасчетПоЗаказамНаТС =
		(уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.ПараметрВыработки, "СпособВводаЗначений") =
		ПредопределенноеЗначение("Перечисление.уатСпособыВводаЗначенийВыработкивМЛ_уэ.ВТабличнойЧасти"));
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьЗначениеПрименение()
	Если Объект.Применение = 1 Тогда
		Применение = "Маршрутные листы";
	ИначеЕсли Объект.Применение = 2 Тогда
		Применение = "Ремонтные листы";
	ИначеЕсли Объект.Применение = 3 Тогда
		Применение = "Премии";
	ИначеЕсли Объект.Применение = 4 Тогда
		Применение = "Удержания";
	ИначеЕсли Объект.Применение = 5 Тогда
		Применение = "Заказы такси";
	Иначе
		Применение = "Путевые листы";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеПрименение()
	Если Применение = "Маршрутные листы" Тогда
		Объект.Применение = 1;
	ИначеЕсли Применение = "Ремонтные листы" Тогда
		Объект.Применение = 2;
	ИначеЕсли Применение = "Премии" Тогда
		Объект.Применение = 3;
	ИначеЕсли Применение = "Удержания" Тогда
		Объект.Применение = 4;
	ИначеЕсли Применение = "Заказы такси" Тогда
		Объект.Применение = 5;
	Иначе
		Объект.Применение = 0;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
